package com.example.animelist;

public class Utils {

    public static final String TITLE_1 = "Черный клевер";
    public static final String TITLE_2 = "Последний серафим";
    public static final String TITLE_3 = "Человек бензопила";
    public static final String TITLE_4 = "Обещанный Неверленд";
    public static final String TITLE_5 = "Наруто";
    public static final String TITLE_6 = "Бездомный бог";
    public static final String TITLE_7 = "Ванпанчмен";
    public static final String TITLE_8 = "Ван Пис";

    public static final String EPISODES_1 = "Темы: магия и сёнен. \n Год выпуска: 2017. \n Возрастной рейтинг: 16+";
    public static final String EPISODES_2 = "Темы: вампиры, военное и сёнен. \n Год выпуска: 2015. \n Возрастной рейтинг: 18+";
    public static final String EPISODES_3 = "Тема: сёнен. \n Год выпуска: 2022. \n Возрастной рейтинг: 18+";
    public static final String EPISODES_4 = "Темы: сёнен и ужасы. \n Годы выпуска: 2019, 2021. \n Возрастной рейтинг: 18+";
    public static final String EPISODES_5 = "Тема: сёнен. \n Год выпуска: 2002. \n Возрастной рейтинг: 18+";
    public static final String EPISODES_6 = "Тема: сёнен. \n Годы выпуска: 2014, 2015. \n Возрастной рейтинг: 16+";
    public static final String EPISODES_7 = "Темы: пародия и суперсила. \n Годы выпуска: 2015, 2019. \n Возрастной рейтинг: 18+";
    public static final String EPISODES_8 = "Темы: сёнен и суперсила. \n Год выпуска: 1999. \n Возрастной рейтинг: 16+";


    public static final String SUBTITLE_1 =  "Их свела общая судьба. Аста и Юно - двое сирот, мечтающих найти своё место под солнцем и когда-нибудь прославиться как великие маги. " +
            "Однако общая судьба - не общий дар, и, как это часто бывает, пока один достигает определённых успехов, другой вынужден плестись позади, " +
            "не проявляя практически никакого таланта. " +
            "Но друг, как известно, познаётся в беде. " +
            "Когда Юно, получившему могущественный гримуар четырёхлистного клевера, угрожает опасность, " +
            "Аста раскрывает весь свой потенциал и получает гримуар, на котором красуется клевер с пятью лепестками, " +
            "прозванный «Чёрным».";
    public static final String SUBTITLE_2 = "Никто из людей не верил в наступление судного дня, но всё же это произошло." +
            " В один злополучный день из недр земли начали появляться кровожадные вампиры. " +
            "Кровососы специально распространили вирус, который уничтожал граждан старше тринадцати лет." +
            " За короткое время всё человечество, кроме детей, было уничтожено. " +
            "Беспомощных детишек вампиры заточили в подземной лаборатории, " +
            "где использовали их как контейнеры с пищей.";
    public static final String SUBTITLE_3 = "Жизнь рыжеволосого Дэндзи наполнена страданиями и невообразимыми испытаниями." +
            " Отец мальчишки был не очень хорошим человеком, " +
            "а потому задолжал якудза крупную сумму. После смерти мужчины выплата долга осталась на плечах юноши. " +
            "Парнишка был в отчаянии и думал, " +
            "что лучше умереть, но на его пути повстречался демон, " +
            "который вскоре стал лучшим и единственным другом.";
    public static final String SUBTITLE_4 = "В обычном приюте воспитываются одарённые детишки, которые мечтают попасть в хорошую семью. " +
            "Каждый воспитанник казённого дома старается чем-то отличиться," +
            " а потому детвора старательно учится и физически развивается. " +
            "На очередном тестировании стали лучшими Норман, Э" +
            "мма и Рей. Друзья часто беседуют на взрослые темы, " +
            "а также рассуждают о главном запрете приюта.";
    public static final String SUBTITLE_5 = "Познакомьтесь с Наруто Узумаки – юным ниндзя, которому предстоит пройти долгий путь к своей мечте." +
            " Однако для достижения любой цели нужны верные товарищи, которых Наруто предстоит обрести. " +
            "Эта история о том, как найти в себе силы не сдаваться, когда никто вокруг не верит в успех. " +
            "А ещё это исключительная и неповторимая в своём роде классика – самое занимательное приключение ниндзя всех времён!";
    public static final String SUBTITLE_6 = "Восток - дело тонкое, особенно если дело касается богов." +
            " Многообразие японского пантеона на руку далеко не всем, среди местных богов процветает конкуренция за место в умах людей, " +
            "ведь те, о ком люди совсем позабудут, исчезают." +
            " Одному из таких древних мелких божков по имени Ято исчезать совсем неохота, " +
            "поэтому он устраивается «богом по вызову» и выполняет просьбы людей," +
            " попутно охотясь на призраков.";
    public static final String SUBTITLE_7 = "Каково живётся самому сильному человеку в мире? " +
            "Не так уж и классно, как может показаться на первый взгляд. " +
            "Когда ты всего достиг, научившись выносить злодеев буквально с одного удара, " +
            "жизнь теряет краски, пропадает сам интерес к жизни, ведь не к чему стремиться. " +
            "С подобным внутренним кризисом сталкивается " +
            "Сайтама - самый сильный человек на планете, погрязший в рутине и потерявший радость от побед над монстрами и преступниками. ";
    public static final String SUBTITLE_8 = "Бороздящие просторы Гранд-Лайна пираты уже отчаялись найти таинственное сокровище легендарного Короля Пиратов Роджера, " +
            "сулящие нашедшему их счастливчику роскошную жизнь." +
            " Спустя годы для большинства авантюристов мифический клад превратился в красивую легенду, " +
            "но только не для молодого Монки Д. " +
            "ЛуффиБороздящие просторы Гранд-Лайна пираты уже отчаялись найти таинственное сокровище легендарного Короля Пиратов Роджера, " +
            "сулящие нашедшему их счастливчику роскошную жизнь. " +
            "Спустя годы для большинства авантюристов мифический клад превратился в красивую легенду," +
            " но только не для молодого Монки Д. Луффи";
}
